GopalSaraf/Practicals/PSDL/include/proc/pic18f87j94.inc
// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0EF2h
// bitfield definitions
PMD2_TMR0MD_POSN                         equ 0000h
PMD2_TMR0MD_POSITION                     equ 0000h
PMD2_TMR0MD_SIZE                         equ 0001h
PMD2_TMR0MD_LENGTH                       equ 0001h
PMD2_TMR0MD_MASK                         equ 0001h
PMD2_TMR1MD_POSN                         equ 0001h
PMD2_TMR1MD_POSITION                     equ 0001h
PMD2_TMR1MD_SIZE                         equ 0001h
PMD2_TMR1MD_LENGTH                       equ 0001h
PMD2_TMR1MD_MASK                         equ 0002h
PMD2_TMR2MD_POSN                         equ 0002h
PMD2_TMR2MD_POSITION                     equ 0002h
PMD2_TMR2MD_SIZE                         equ 0001h
PMD2_TMR2MD_LENGTH                       equ 0001h
PMD2_TMR2MD_MASK                         equ 0004h
PMD2_TMR3MD_POSN                         equ 0003h
PMD2_TMR3MD_POSITION                     equ 0003h
PMD2_TMR3MD_SIZE                         equ 0001h
PMD2_TMR3MD_LENGTH                       equ 0001h
PMD2_TMR3MD_MASK                         equ 0008h
PMD2_TMR4MD_POSN                         equ 0004h
PMD2_TMR4MD_POSITION                     equ 0004h
PMD2_TMR4MD_SIZE                         equ 0001h
PMD2_TMR4MD_LENGTH                       equ 0001h
PMD2_TMR4MD_MASK                         equ 0010h
PMD2_TMR5MD_POSN                         equ 0005h
PMD2_TMR5MD_POSITION                     equ 0005h
PMD2_TMR5MD_SIZE                         equ 0001h
PMD2_TMR5MD_LENGTH                       equ 0001h
PMD2_TMR5MD_MASK                         equ 0020h
PMD2_TMR6MD_POSN                         equ 0006h
PMD2_TMR6MD_POSITION                     equ 0006h
PMD2_TMR6MD_SIZE                         equ 0001h
PMD2_TMR6MD_LENGTH                       equ 0001h
PMD2_TMR6MD_MASK                         equ 0040h
PMD2_TMR8MD_POSN                         equ 0007h
PMD2_TMR8MD_POSITION                     equ 0007h
PMD2_TMR8MD_SIZE                         equ 0001h
PMD2_TMR8MD_LENGTH                       equ 0001h
PMD2_TMR8MD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0EF3h
// bitfield definitions
PMD1_SSP1MD_POSN                         equ 0000h
PMD1_SSP1MD_POSITION                     equ 0000h
PMD1_SSP1MD_SIZE                         equ 0001h
PMD1_SSP1MD_LENGTH                       equ 0001h
PMD1_SSP1MD_MASK                         equ 0001h
PMD1_SSP2MD_POSN                         equ 0001h
PMD1_SSP2MD_POSITION                     equ 0001h
PMD1_SSP2MD_SIZE                         equ 0001h
PMD1_SSP2MD_LENGTH                       equ 0001h
PMD1_SSP2MD_MASK                         equ 0002h
PMD1_UART1MD_POSN                        equ 0002h
PMD1_UART1MD_POSITION                    equ 0002h
PMD1_UART1MD_SIZE                        equ 0001h
PMD1_UART1MD_LENGTH                      equ 0001h
PMD1_UART1MD_MASK                        equ 0004h
PMD1_UART2MD_POSN                        equ 0003h
PMD1_UART2MD_POSITION                    equ 0003h
PMD1_UART2MD_SIZE                        equ 0001h
PMD1_UART2MD_LENGTH                      equ 0001h
PMD1_UART2MD_MASK                        equ 0008h
PMD1_UART3MD_POSN                        equ 0004h
PMD1_UART3MD_POSITION                    equ 0004h
PMD1_UART3MD_SIZE                        equ 0001h
PMD1_UART3MD_LENGTH                      equ 0001h
PMD1_UART3MD_MASK                        equ 0010h
PMD1_UART4MD_POSN                        equ 0005h
PMD1_UART4MD_POSITION                    equ 0005h
PMD1_UART4MD_SIZE                        equ 0001h
PMD1_UART4MD_LENGTH                      equ 0001h
PMD1_UART4MD_MASK                        equ 0020h
PMD1_ECCP1MD_POSN                        equ 0006h
PMD1_ECCP1MD_POSITION                    equ 0006h
PMD1_ECCP1MD_SIZE                        equ 0001h
PMD1_ECCP1MD_LENGTH                      equ 0001h
PMD1_ECCP1MD_MASK                        equ 0040h
PMD1_ECCP2MD_POSN                        equ 0007h
PMD1_ECCP2MD_POSITION                    equ 0007h
PMD1_ECCP2MD_SIZE                        equ 0001h
PMD1_ECCP2MD_LENGTH                      equ 0001h
PMD1_ECCP2MD_MASK                        equ 0080h
PMD1_EMBMD_POSN                          equ 0000h
PMD1_EMBMD_POSITION                      equ 0000h
PMD1_EMBMD_SIZE                          equ 0001h
PMD1_EMBMD_LENGTH                        equ 0001h
PMD1_EMBMD_MASK                          equ 0001h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0EF4h
// bitfield definitions
PMD0_ECCP3MD_POSN                        equ 0000h
PMD0_ECCP3MD_POSITION                    equ 0000h
PMD0_ECCP3MD_SIZE                        equ 0001h
PMD0_ECCP3MD_LENGTH                      equ 0001h
PMD0_ECCP3MD_MASK                        equ 0001h
PMD0_CCP4MD_POSN                         equ 0001h
PMD0_CCP4MD_POSITION                     equ 0001h
PMD0_CCP4MD_SIZE                         equ 0001h
PMD0_CCP4MD_LENGTH                       equ 0001h
PMD0_CCP4MD_MASK                         equ 0002h
PMD0_CCP5MD_POSN                         equ 0002h
PMD0_CCP5MD_POSITION                     equ 0002h
PMD0_CCP5MD_SIZE                         equ 0001h
PMD0_CCP5MD_LENGTH                       equ 0001h
PMD0_CCP5MD_MASK                         equ 0004h
PMD0_CCP6MD_POSN                         equ 0003h
PMD0_CCP6MD_POSITION                     equ 0003h
PMD0_CCP6MD_SIZE                         equ 0001h
PMD0_CCP6MD_LENGTH                       equ 0001h
PMD0_CCP6MD_MASK                         equ 0008h
PMD0_CCP7MD_POSN                         equ 0004h
PMD0_CCP7MD_POSITION                     equ 0004h
PMD0_CCP7MD_SIZE                         equ 0001h
PMD0_CCP7MD_LENGTH                       equ 0001h
PMD0_CCP7MD_MASK                         equ 0010h
PMD0_CCP8MD_POSN                         equ 0005h
PMD0_CCP8MD_POSITION                     equ 0005h
PMD0_CCP8MD_SIZE                         equ 0001h
PMD0_CCP8MD_LENGTH                       equ 0001h
PMD0_CCP8MD_MASK                         equ 0020h
PMD0_CCP9MD_POSN                         equ 0006h
PMD0_CCP9MD_POSITION                     equ 0006h
PMD0_CCP9MD_SIZE                         equ 0001h
PMD0_CCP9MD_LENGTH                       equ 0001h
PMD0_CCP9MD_MASK                         equ 0040h
PMD0_CCP10MD_POSN                        equ 0007h
PMD0_CCP10MD_POSITION                    equ 0007h
PMD0_CCP10MD_SIZE                        equ 0001h
PMD0_CCP10MD_LENGTH                      equ 0001h
PMD0_CCP10MD_MASK                        equ 0080h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

// Register: CTMUCON4
#define CTMUCON4 CTMUCON4
CTMUCON4                                 equ 0EF5h
// bitfield definitions
CTMUCON4_EDG1STAT_POSN                   equ 0000h
CTMUCON4_EDG1STAT_POSITION               equ 0000h
CTMUCON4_EDG1STAT_SIZE                   equ 0001h
CTMUCON4_EDG1STAT_LENGTH                 equ 0001h
CTMUCON4_EDG1STAT_MASK                   equ 0001h
CTMUCON4_EDG2STAT_POSN                   equ 0001h
CTMUCON4_EDG2STAT_POSITION               equ 0001h
CTMUCON4_EDG2STAT_SIZE                   equ 0001h
CTMUCON4_EDG2STAT_LENGTH                 equ 0001h
CTMUCON4_EDG2STAT_MASK                   equ 0002h
CTMUCON4_EDG1SEL_POSN                    equ 0002h
CTMUCON4_EDG1SEL_POSITION                equ 0002h
CTMUCON4_EDG1SEL_SIZE                    equ 0004h
CTMUCON4_EDG1SEL_LENGTH                  equ 0004h
CTMUCON4_EDG1SEL_MASK                    equ 003Ch
CTMUCON4_EDG1POL_POSN                    equ 0006h
CTMUCON4_EDG1POL_POSITION                equ 0006h
CTMUCON4_EDG1POL_SIZE                    equ 0001h
CTMUCON4_EDG1POL_LENGTH                  equ 0001h
CTMUCON4_EDG1POL_MASK                    equ 0040h
CTMUCON4_EDG1EN_POSN                     equ 0007h
CTMUCON4_EDG1EN_POSITION                 equ 0007h
CTMUCON4_EDG1EN_SIZE                     equ 0001h
CTMUCON4_EDG1EN_LENGTH                   equ 0001h
CTMUCON4_EDG1EN_MASK                     equ 0080h
CTMUCON4_EDG1SEL0_POSN                   equ 0002h
CTMUCON4_EDG1SEL0_POSITION               equ 0002h
CTMUCON4_EDG1SEL0_SIZE                   equ 0001h
CTMUCON4_EDG1SEL0_LENGTH                 equ 0001h
CTMUCON4_EDG1SEL0_MASK                   equ 0004h
CTMUCON4_EDG1SEL1_POSN                   equ 0003h
CTMUCON4_EDG1SEL1_POSITION               equ 0003h
CTMUCON4_EDG1SEL1_SIZE                   equ 0001h
CTMUCON4_EDG1SEL1_LENGTH                 equ 0001h
CTMUCON4_EDG1SEL1_MASK                   equ 0008h
CTMUCON4_EDG1SEL2_POSN                   equ 0004h
CTMUCON4_EDG1SEL2_POSITION               equ 0004h
CTMUCON4_EDG1SEL2_SIZE                   equ 0001h
CTMUCON4_EDG1SEL2_LENGTH                 equ 0001h
CTMUCON4_EDG1SEL2_MASK                   equ 0010h
CTMUCON4_EDG1SEL3_POSN                   equ 0005h
CTMUCON4_EDG1SEL3_POSITION               equ 0005h
CTMUCON4_EDG1SEL3_SIZE                   equ 0001h
CTMUCON4_EDG1SEL3_LENGTH                 equ 0001h
CTMUCON4_EDG1SEL3_MASK                   equ 0020h

