GopalSaraf/Practicals/PSDL/include/proc/pic18f87j94.inc
// Register: RCREG4
#define RCREG4 RCREG4
RCREG4                                   equ 0EFAh
// bitfield definitions
RCREG4_RCREG4_POSN                       equ 0000h
RCREG4_RCREG4_POSITION                   equ 0000h
RCREG4_RCREG4_SIZE                       equ 0008h
RCREG4_RCREG4_LENGTH                     equ 0008h
RCREG4_RCREG4_MASK                       equ 00FFh

// Register: SPBRG4
#define SPBRG4 SPBRG4
SPBRG4                                   equ 0EFBh
// bitfield definitions
SPBRG4_SPBRG4_POSN                       equ 0000h
SPBRG4_SPBRG4_POSITION                   equ 0000h
SPBRG4_SPBRG4_SIZE                       equ 0008h
SPBRG4_SPBRG4_LENGTH                     equ 0008h
SPBRG4_SPBRG4_MASK                       equ 00FFh
SPBRG4_BRG0_POSN                         equ 0000h
SPBRG4_BRG0_POSITION                     equ 0000h
SPBRG4_BRG0_SIZE                         equ 0001h
SPBRG4_BRG0_LENGTH                       equ 0001h
SPBRG4_BRG0_MASK                         equ 0001h
SPBRG4_BRG1_POSN                         equ 0001h
SPBRG4_BRG1_POSITION                     equ 0001h
SPBRG4_BRG1_SIZE                         equ 0001h
SPBRG4_BRG1_LENGTH                       equ 0001h
SPBRG4_BRG1_MASK                         equ 0002h
SPBRG4_BRG2_POSN                         equ 0002h
SPBRG4_BRG2_POSITION                     equ 0002h
SPBRG4_BRG2_SIZE                         equ 0001h
SPBRG4_BRG2_LENGTH                       equ 0001h
SPBRG4_BRG2_MASK                         equ 0004h
SPBRG4_BRG3_POSN                         equ 0003h
SPBRG4_BRG3_POSITION                     equ 0003h
SPBRG4_BRG3_SIZE                         equ 0001h
SPBRG4_BRG3_LENGTH                       equ 0001h
SPBRG4_BRG3_MASK                         equ 0008h
SPBRG4_BRG4_POSN                         equ 0004h
SPBRG4_BRG4_POSITION                     equ 0004h
SPBRG4_BRG4_SIZE                         equ 0001h
SPBRG4_BRG4_LENGTH                       equ 0001h
SPBRG4_BRG4_MASK                         equ 0010h
SPBRG4_BRG5_POSN                         equ 0005h
SPBRG4_BRG5_POSITION                     equ 0005h
SPBRG4_BRG5_SIZE                         equ 0001h
SPBRG4_BRG5_LENGTH                       equ 0001h
SPBRG4_BRG5_MASK                         equ 0020h
SPBRG4_BRG6_POSN                         equ 0006h
SPBRG4_BRG6_POSITION                     equ 0006h
SPBRG4_BRG6_SIZE                         equ 0001h
SPBRG4_BRG6_LENGTH                       equ 0001h
SPBRG4_BRG6_MASK                         equ 0040h
SPBRG4_BRG7_POSN                         equ 0007h
SPBRG4_BRG7_POSITION                     equ 0007h
SPBRG4_BRG7_SIZE                         equ 0001h
SPBRG4_BRG7_LENGTH                       equ 0001h
SPBRG4_BRG7_MASK                         equ 0080h

// Register: SPBRGH4
#define SPBRGH4 SPBRGH4
SPBRGH4                                  equ 0EFCh
// bitfield definitions
SPBRGH4_SPBRGH4_POSN                     equ 0000h
SPBRGH4_SPBRGH4_POSITION                 equ 0000h
SPBRGH4_SPBRGH4_SIZE                     equ 0008h
SPBRGH4_SPBRGH4_LENGTH                   equ 0008h
SPBRGH4_SPBRGH4_MASK                     equ 00FFh
SPBRGH4_BRG8_POSN                        equ 0000h
SPBRGH4_BRG8_POSITION                    equ 0000h
SPBRGH4_BRG8_SIZE                        equ 0001h
SPBRGH4_BRG8_LENGTH                      equ 0001h
SPBRGH4_BRG8_MASK                        equ 0001h
SPBRGH4_BRG9_POSN                        equ 0001h
SPBRGH4_BRG9_POSITION                    equ 0001h
SPBRGH4_BRG9_SIZE                        equ 0001h
SPBRGH4_BRG9_LENGTH                      equ 0001h
SPBRGH4_BRG9_MASK                        equ 0002h
SPBRGH4_BRG10_POSN                       equ 0002h
SPBRGH4_BRG10_POSITION                   equ 0002h
SPBRGH4_BRG10_SIZE                       equ 0001h
SPBRGH4_BRG10_LENGTH                     equ 0001h
SPBRGH4_BRG10_MASK                       equ 0004h
SPBRGH4_BRG11_POSN                       equ 0003h
SPBRGH4_BRG11_POSITION                   equ 0003h
SPBRGH4_BRG11_SIZE                       equ 0001h
SPBRGH4_BRG11_LENGTH                     equ 0001h
SPBRGH4_BRG11_MASK                       equ 0008h
SPBRGH4_BRG12_POSN                       equ 0004h
SPBRGH4_BRG12_POSITION                   equ 0004h
SPBRGH4_BRG12_SIZE                       equ 0001h
SPBRGH4_BRG12_LENGTH                     equ 0001h
SPBRGH4_BRG12_MASK                       equ 0010h
SPBRGH4_BRG13_POSN                       equ 0005h
SPBRGH4_BRG13_POSITION                   equ 0005h
SPBRGH4_BRG13_SIZE                       equ 0001h
SPBRGH4_BRG13_LENGTH                     equ 0001h
SPBRGH4_BRG13_MASK                       equ 0020h
SPBRGH4_BRG14_POSN                       equ 0006h
SPBRGH4_BRG14_POSITION                   equ 0006h
SPBRGH4_BRG14_SIZE                       equ 0001h
SPBRGH4_BRG14_LENGTH                     equ 0001h
SPBRGH4_BRG14_MASK                       equ 0040h
SPBRGH4_BRG15_POSN                       equ 0007h
SPBRGH4_BRG15_POSITION                   equ 0007h
SPBRGH4_BRG15_SIZE                       equ 0001h
SPBRGH4_BRG15_LENGTH                     equ 0001h
SPBRGH4_BRG15_MASK                       equ 0080h

// Register: BAUDCON4
#define BAUDCON4 BAUDCON4
BAUDCON4                                 equ 0EFDh
// bitfield definitions
BAUDCON4_ABDEN_POSN                      equ 0000h
BAUDCON4_ABDEN_POSITION                  equ 0000h
BAUDCON4_ABDEN_SIZE                      equ 0001h
BAUDCON4_ABDEN_LENGTH                    equ 0001h
BAUDCON4_ABDEN_MASK                      equ 0001h
BAUDCON4_WUE_POSN                        equ 0001h
BAUDCON4_WUE_POSITION                    equ 0001h
BAUDCON4_WUE_SIZE                        equ 0001h
BAUDCON4_WUE_LENGTH                      equ 0001h
BAUDCON4_WUE_MASK                        equ 0002h
BAUDCON4_IREN_POSN                       equ 0002h
BAUDCON4_IREN_POSITION                   equ 0002h
BAUDCON4_IREN_SIZE                       equ 0001h
BAUDCON4_IREN_LENGTH                     equ 0001h
BAUDCON4_IREN_MASK                       equ 0004h
BAUDCON4_BRG16_POSN                      equ 0003h
BAUDCON4_BRG16_POSITION                  equ 0003h
BAUDCON4_BRG16_SIZE                      equ 0001h
BAUDCON4_BRG16_LENGTH                    equ 0001h
BAUDCON4_BRG16_MASK                      equ 0008h
BAUDCON4_TXCKP_POSN                      equ 0004h
BAUDCON4_TXCKP_POSITION                  equ 0004h
BAUDCON4_TXCKP_SIZE                      equ 0001h
BAUDCON4_TXCKP_LENGTH                    equ 0001h
BAUDCON4_TXCKP_MASK                      equ 0010h
BAUDCON4_RXDTP_POSN                      equ 0005h
BAUDCON4_RXDTP_POSITION                  equ 0005h
BAUDCON4_RXDTP_SIZE                      equ 0001h
BAUDCON4_RXDTP_LENGTH                    equ 0001h
BAUDCON4_RXDTP_MASK                      equ 0020h
BAUDCON4_RCIDL_POSN                      equ 0006h
BAUDCON4_RCIDL_POSITION                  equ 0006h
BAUDCON4_RCIDL_SIZE                      equ 0001h
BAUDCON4_RCIDL_LENGTH                    equ 0001h
BAUDCON4_RCIDL_MASK                      equ 0040h
BAUDCON4_ABDOVF_POSN                     equ 0007h
BAUDCON4_ABDOVF_POSITION                 equ 0007h
BAUDCON4_ABDOVF_SIZE                     equ 0001h
BAUDCON4_ABDOVF_LENGTH                   equ 0001h
BAUDCON4_ABDOVF_MASK                     equ 0080h
BAUDCON4_ABDEN4_POSN                     equ 0000h
BAUDCON4_ABDEN4_POSITION                 equ 0000h
BAUDCON4_ABDEN4_SIZE                     equ 0001h
BAUDCON4_ABDEN4_LENGTH                   equ 0001h
BAUDCON4_ABDEN4_MASK                     equ 0001h
BAUDCON4_WUE4_POSN                       equ 0001h
BAUDCON4_WUE4_POSITION                   equ 0001h
BAUDCON4_WUE4_SIZE                       equ 0001h
BAUDCON4_WUE4_LENGTH                     equ 0001h
BAUDCON4_WUE4_MASK                       equ 0002h
BAUDCON4_BRG164_POSN                     equ 0003h
BAUDCON4_BRG164_POSITION                 equ 0003h
BAUDCON4_BRG164_SIZE                     equ 0001h
BAUDCON4_BRG164_LENGTH                   equ 0001h
BAUDCON4_BRG164_MASK                     equ 0008h
BAUDCON4_SCKP4_POSN                      equ 0004h
BAUDCON4_SCKP4_POSITION                  equ 0004h
BAUDCON4_SCKP4_SIZE                      equ 0001h
BAUDCON4_SCKP4_LENGTH                    equ 0001h
BAUDCON4_SCKP4_MASK                      equ 0010h
BAUDCON4_DTRXP4_POSN                     equ 0005h
BAUDCON4_DTRXP4_POSITION                 equ 0005h
BAUDCON4_DTRXP4_SIZE                     equ 0001h
BAUDCON4_DTRXP4_LENGTH                   equ 0001h
BAUDCON4_DTRXP4_MASK                     equ 0020h
BAUDCON4_RCIDL4_POSN                     equ 0006h
BAUDCON4_RCIDL4_POSITION                 equ 0006h
BAUDCON4_RCIDL4_SIZE                     equ 0001h
BAUDCON4_RCIDL4_LENGTH                   equ 0001h
BAUDCON4_RCIDL4_MASK                     equ 0040h
BAUDCON4_ABDOVF4_POSN                    equ 0007h
BAUDCON4_ABDOVF4_POSITION                equ 0007h
BAUDCON4_ABDOVF4_SIZE                    equ 0001h
BAUDCON4_ABDOVF4_LENGTH                  equ 0001h
BAUDCON4_ABDOVF4_MASK                    equ 0080h
BAUDCON4_TXCKP4_POSN                     equ 0004h
BAUDCON4_TXCKP4_POSITION                 equ 0004h
BAUDCON4_TXCKP4_SIZE                     equ 0001h
BAUDCON4_TXCKP4_LENGTH                   equ 0001h
BAUDCON4_TXCKP4_MASK                     equ 0010h
BAUDCON4_RXDTP4_POSN                     equ 0005h
BAUDCON4_RXDTP4_POSITION                 equ 0005h
BAUDCON4_RXDTP4_SIZE                     equ 0001h
BAUDCON4_RXDTP4_LENGTH                   equ 0001h
BAUDCON4_RXDTP4_MASK                     equ 0020h
BAUDCON4_RCMT4_POSN                      equ 0006h
BAUDCON4_RCMT4_POSITION                  equ 0006h
BAUDCON4_RCMT4_SIZE                      equ 0001h
BAUDCON4_RCMT4_LENGTH                    equ 0001h
BAUDCON4_RCMT4_MASK                      equ 0040h

// Register: TXSTA4
#define TXSTA4 TXSTA4
TXSTA4                                   equ 0EFEh
// bitfield definitions
TXSTA4_TX9D_POSN                         equ 0000h
TXSTA4_TX9D_POSITION                     equ 0000h
TXSTA4_TX9D_SIZE                         equ 0001h
TXSTA4_TX9D_LENGTH                       equ 0001h
TXSTA4_TX9D_MASK                         equ 0001h
TXSTA4_TRMT_POSN                         equ 0001h
TXSTA4_TRMT_POSITION                     equ 0001h
TXSTA4_TRMT_SIZE                         equ 0001h
TXSTA4_TRMT_LENGTH                       equ 0001h
TXSTA4_TRMT_MASK                         equ 0002h
TXSTA4_BRGH_POSN                         equ 0002h
TXSTA4_BRGH_POSITION                     equ 0002h
TXSTA4_BRGH_SIZE                         equ 0001h
TXSTA4_BRGH_LENGTH                       equ 0001h
TXSTA4_BRGH_MASK                         equ 0004h
TXSTA4_SENDB_POSN                        equ 0003h
TXSTA4_SENDB_POSITION                    equ 0003h
TXSTA4_SENDB_SIZE                        equ 0001h
TXSTA4_SENDB_LENGTH                      equ 0001h
TXSTA4_SENDB_MASK                        equ 0008h
TXSTA4_SYNC_POSN                         equ 0004h
TXSTA4_SYNC_POSITION                     equ 0004h
TXSTA4_SYNC_SIZE                         equ 0001h
TXSTA4_SYNC_LENGTH                       equ 0001h
TXSTA4_SYNC_MASK                         equ 0010h
TXSTA4_TXEN_POSN                         equ 0005h
TXSTA4_TXEN_POSITION                     equ 0005h
TXSTA4_TXEN_SIZE                         equ 0001h
TXSTA4_TXEN_LENGTH                       equ 0001h
TXSTA4_TXEN_MASK                         equ 0020h
TXSTA4_TX9_POSN                          equ 0006h
TXSTA4_TX9_POSITION                      equ 0006h
TXSTA4_TX9_SIZE                          equ 0001h
TXSTA4_TX9_LENGTH                        equ 0001h
TXSTA4_TX9_MASK                          equ 0040h
TXSTA4_CSRC_POSN                         equ 0007h
TXSTA4_CSRC_POSITION                     equ 0007h
TXSTA4_CSRC_SIZE                         equ 0001h
TXSTA4_CSRC_LENGTH                       equ 0001h
TXSTA4_CSRC_MASK                         equ 0080h
TXSTA4_TXD84_POSN                        equ 0000h
TXSTA4_TXD84_POSITION                    equ 0000h
TXSTA4_TXD84_SIZE                        equ 0001h
TXSTA4_TXD84_LENGTH                      equ 0001h
TXSTA4_TXD84_MASK                        equ 0001h
TXSTA4_TX8_94_POSN                       equ 0006h
TXSTA4_TX8_94_POSITION                   equ 0006h
TXSTA4_TX8_94_SIZE                       equ 0001h
TXSTA4_TX8_94_LENGTH                     equ 0001h
TXSTA4_TX8_94_MASK                       equ 0040h

