GopalSaraf/Practicals/PSDL/include/proc/pic18f87j94.inc
// Register: PORTVP
#define PORTVP PORTVP
PORTVP                                   equ 0F71h
// bitfield definitions
PORTVP_RVP0_POSN                         equ 0000h
PORTVP_RVP0_POSITION                     equ 0000h
PORTVP_RVP0_SIZE                         equ 0001h
PORTVP_RVP0_LENGTH                       equ 0001h
PORTVP_RVP0_MASK                         equ 0001h
PORTVP_RVP1_POSN                         equ 0001h
PORTVP_RVP1_POSITION                     equ 0001h
PORTVP_RVP1_SIZE                         equ 0001h
PORTVP_RVP1_LENGTH                       equ 0001h
PORTVP_RVP1_MASK                         equ 0002h
PORTVP_RVP2_POSN                         equ 0002h
PORTVP_RVP2_POSITION                     equ 0002h
PORTVP_RVP2_SIZE                         equ 0001h
PORTVP_RVP2_LENGTH                       equ 0001h
PORTVP_RVP2_MASK                         equ 0004h
PORTVP_RVP3_POSN                         equ 0003h
PORTVP_RVP3_POSITION                     equ 0003h
PORTVP_RVP3_SIZE                         equ 0001h
PORTVP_RVP3_LENGTH                       equ 0001h
PORTVP_RVP3_MASK                         equ 0008h
PORTVP_RVP4_POSN                         equ 0004h
PORTVP_RVP4_POSITION                     equ 0004h
PORTVP_RVP4_SIZE                         equ 0001h
PORTVP_RVP4_LENGTH                       equ 0001h
PORTVP_RVP4_MASK                         equ 0010h
PORTVP_RVP5_POSN                         equ 0005h
PORTVP_RVP5_POSITION                     equ 0005h
PORTVP_RVP5_SIZE                         equ 0001h
PORTVP_RVP5_LENGTH                       equ 0001h
PORTVP_RVP5_MASK                         equ 0020h
PORTVP_RVP6_POSN                         equ 0006h
PORTVP_RVP6_POSITION                     equ 0006h
PORTVP_RVP6_SIZE                         equ 0001h
PORTVP_RVP6_LENGTH                       equ 0001h
PORTVP_RVP6_MASK                         equ 0040h
PORTVP_RVP7_POSN                         equ 0007h
PORTVP_RVP7_POSITION                     equ 0007h
PORTVP_RVP7_SIZE                         equ 0001h
PORTVP_RVP7_LENGTH                       equ 0001h
PORTVP_RVP7_MASK                         equ 0080h

// Register: LATVP
#define LATVP LATVP
LATVP                                    equ 0F72h
// bitfield definitions
LATVP_LATVP0_POSN                        equ 0000h
LATVP_LATVP0_POSITION                    equ 0000h
LATVP_LATVP0_SIZE                        equ 0001h
LATVP_LATVP0_LENGTH                      equ 0001h
LATVP_LATVP0_MASK                        equ 0001h
LATVP_LATVP1_POSN                        equ 0001h
LATVP_LATVP1_POSITION                    equ 0001h
LATVP_LATVP1_SIZE                        equ 0001h
LATVP_LATVP1_LENGTH                      equ 0001h
LATVP_LATVP1_MASK                        equ 0002h
LATVP_LATVP2_POSN                        equ 0002h
LATVP_LATVP2_POSITION                    equ 0002h
LATVP_LATVP2_SIZE                        equ 0001h
LATVP_LATVP2_LENGTH                      equ 0001h
LATVP_LATVP2_MASK                        equ 0004h
LATVP_LATVP3_POSN                        equ 0003h
LATVP_LATVP3_POSITION                    equ 0003h
LATVP_LATVP3_SIZE                        equ 0001h
LATVP_LATVP3_LENGTH                      equ 0001h
LATVP_LATVP3_MASK                        equ 0008h
LATVP_LATVP4_POSN                        equ 0004h
LATVP_LATVP4_POSITION                    equ 0004h
LATVP_LATVP4_SIZE                        equ 0001h
LATVP_LATVP4_LENGTH                      equ 0001h
LATVP_LATVP4_MASK                        equ 0010h
LATVP_LATVP5_POSN                        equ 0005h
LATVP_LATVP5_POSITION                    equ 0005h
LATVP_LATVP5_SIZE                        equ 0001h
LATVP_LATVP5_LENGTH                      equ 0001h
LATVP_LATVP5_MASK                        equ 0020h
LATVP_LATVP6_POSN                        equ 0006h
LATVP_LATVP6_POSITION                    equ 0006h
LATVP_LATVP6_SIZE                        equ 0001h
LATVP_LATVP6_LENGTH                      equ 0001h
LATVP_LATVP6_MASK                        equ 0040h
LATVP_LATVP7_POSN                        equ 0007h
LATVP_LATVP7_POSITION                    equ 0007h
LATVP_LATVP7_SIZE                        equ 0001h
LATVP_LATVP7_LENGTH                      equ 0001h
LATVP_LATVP7_MASK                        equ 0080h

// Register: TRISVP
#define TRISVP TRISVP
TRISVP                                   equ 0F73h
// bitfield definitions
TRISVP_TRISVP0_POSN                      equ 0000h
TRISVP_TRISVP0_POSITION                  equ 0000h
TRISVP_TRISVP0_SIZE                      equ 0001h
TRISVP_TRISVP0_LENGTH                    equ 0001h
TRISVP_TRISVP0_MASK                      equ 0001h
TRISVP_TRISVP1_POSN                      equ 0001h
TRISVP_TRISVP1_POSITION                  equ 0001h
TRISVP_TRISVP1_SIZE                      equ 0001h
TRISVP_TRISVP1_LENGTH                    equ 0001h
TRISVP_TRISVP1_MASK                      equ 0002h
TRISVP_TRISVP2_POSN                      equ 0002h
TRISVP_TRISVP2_POSITION                  equ 0002h
TRISVP_TRISVP2_SIZE                      equ 0001h
TRISVP_TRISVP2_LENGTH                    equ 0001h
TRISVP_TRISVP2_MASK                      equ 0004h
TRISVP_TRISVP3_POSN                      equ 0003h
TRISVP_TRISVP3_POSITION                  equ 0003h
TRISVP_TRISVP3_SIZE                      equ 0001h
TRISVP_TRISVP3_LENGTH                    equ 0001h
TRISVP_TRISVP3_MASK                      equ 0008h
TRISVP_TRISVP4_POSN                      equ 0004h
TRISVP_TRISVP4_POSITION                  equ 0004h
TRISVP_TRISVP4_SIZE                      equ 0001h
TRISVP_TRISVP4_LENGTH                    equ 0001h
TRISVP_TRISVP4_MASK                      equ 0010h
TRISVP_TRISVP5_POSN                      equ 0005h
TRISVP_TRISVP5_POSITION                  equ 0005h
TRISVP_TRISVP5_SIZE                      equ 0001h
TRISVP_TRISVP5_LENGTH                    equ 0001h
TRISVP_TRISVP5_MASK                      equ 0020h
TRISVP_TRISVP6_POSN                      equ 0006h
TRISVP_TRISVP6_POSITION                  equ 0006h
TRISVP_TRISVP6_SIZE                      equ 0001h
TRISVP_TRISVP6_LENGTH                    equ 0001h
TRISVP_TRISVP6_MASK                      equ 0040h
TRISVP_TRISVP7_POSN                      equ 0007h
TRISVP_TRISVP7_POSITION                  equ 0007h
TRISVP_TRISVP7_SIZE                      equ 0001h
TRISVP_TRISVP7_LENGTH                    equ 0001h
TRISVP_TRISVP7_MASK                      equ 0080h

// Register: UADDR
#define UADDR UADDR
UADDR                                    equ 0F74h
// bitfield definitions
UADDR_ADDR_POSN                          equ 0000h
UADDR_ADDR_POSITION                      equ 0000h
UADDR_ADDR_SIZE                          equ 0007h
UADDR_ADDR_LENGTH                        equ 0007h
UADDR_ADDR_MASK                          equ 007Fh
UADDR_ADDR0_POSN                         equ 0000h
UADDR_ADDR0_POSITION                     equ 0000h
UADDR_ADDR0_SIZE                         equ 0001h
UADDR_ADDR0_LENGTH                       equ 0001h
UADDR_ADDR0_MASK                         equ 0001h
UADDR_ADDR1_POSN                         equ 0001h
UADDR_ADDR1_POSITION                     equ 0001h
UADDR_ADDR1_SIZE                         equ 0001h
UADDR_ADDR1_LENGTH                       equ 0001h
UADDR_ADDR1_MASK                         equ 0002h
UADDR_ADDR2_POSN                         equ 0002h
UADDR_ADDR2_POSITION                     equ 0002h
UADDR_ADDR2_SIZE                         equ 0001h
UADDR_ADDR2_LENGTH                       equ 0001h
UADDR_ADDR2_MASK                         equ 0004h
UADDR_ADDR3_POSN                         equ 0003h
UADDR_ADDR3_POSITION                     equ 0003h
UADDR_ADDR3_SIZE                         equ 0001h
UADDR_ADDR3_LENGTH                       equ 0001h
UADDR_ADDR3_MASK                         equ 0008h
UADDR_ADDR4_POSN                         equ 0004h
UADDR_ADDR4_POSITION                     equ 0004h
UADDR_ADDR4_SIZE                         equ 0001h
UADDR_ADDR4_LENGTH                       equ 0001h
UADDR_ADDR4_MASK                         equ 0010h
UADDR_ADDR5_POSN                         equ 0005h
UADDR_ADDR5_POSITION                     equ 0005h
UADDR_ADDR5_SIZE                         equ 0001h
UADDR_ADDR5_LENGTH                       equ 0001h
UADDR_ADDR5_MASK                         equ 0020h
UADDR_ADDR6_POSN                         equ 0006h
UADDR_ADDR6_POSITION                     equ 0006h
UADDR_ADDR6_SIZE                         equ 0001h
UADDR_ADDR6_LENGTH                       equ 0001h
UADDR_ADDR6_MASK                         equ 0040h

