GopalSaraf/Practicals/PSDL/include/proc/pic18f87j94.inc
// Register: ECCP1AS
#define ECCP1AS ECCP1AS
ECCP1AS                                  equ 0FBDh
// bitfield definitions
ECCP1AS_PSS1BD_POSN                      equ 0000h
ECCP1AS_PSS1BD_POSITION                  equ 0000h
ECCP1AS_PSS1BD_SIZE                      equ 0002h
ECCP1AS_PSS1BD_LENGTH                    equ 0002h
ECCP1AS_PSS1BD_MASK                      equ 0003h
ECCP1AS_PSS1AC_POSN                      equ 0002h
ECCP1AS_PSS1AC_POSITION                  equ 0002h
ECCP1AS_PSS1AC_SIZE                      equ 0002h
ECCP1AS_PSS1AC_LENGTH                    equ 0002h
ECCP1AS_PSS1AC_MASK                      equ 000Ch
ECCP1AS_ECCP1AS_POSN                     equ 0004h
ECCP1AS_ECCP1AS_POSITION                 equ 0004h
ECCP1AS_ECCP1AS_SIZE                     equ 0003h
ECCP1AS_ECCP1AS_LENGTH                   equ 0003h
ECCP1AS_ECCP1AS_MASK                     equ 0070h
ECCP1AS_ECCP1ASE_POSN                    equ 0007h
ECCP1AS_ECCP1ASE_POSITION                equ 0007h
ECCP1AS_ECCP1ASE_SIZE                    equ 0001h
ECCP1AS_ECCP1ASE_LENGTH                  equ 0001h
ECCP1AS_ECCP1ASE_MASK                    equ 0080h
ECCP1AS_PSS1BD0_POSN                     equ 0000h
ECCP1AS_PSS1BD0_POSITION                 equ 0000h
ECCP1AS_PSS1BD0_SIZE                     equ 0001h
ECCP1AS_PSS1BD0_LENGTH                   equ 0001h
ECCP1AS_PSS1BD0_MASK                     equ 0001h
ECCP1AS_PSS1BD1_POSN                     equ 0001h
ECCP1AS_PSS1BD1_POSITION                 equ 0001h
ECCP1AS_PSS1BD1_SIZE                     equ 0001h
ECCP1AS_PSS1BD1_LENGTH                   equ 0001h
ECCP1AS_PSS1BD1_MASK                     equ 0002h
ECCP1AS_PSS1AC0_POSN                     equ 0002h
ECCP1AS_PSS1AC0_POSITION                 equ 0002h
ECCP1AS_PSS1AC0_SIZE                     equ 0001h
ECCP1AS_PSS1AC0_LENGTH                   equ 0001h
ECCP1AS_PSS1AC0_MASK                     equ 0004h
ECCP1AS_PSS1AC1_POSN                     equ 0003h
ECCP1AS_PSS1AC1_POSITION                 equ 0003h
ECCP1AS_PSS1AC1_SIZE                     equ 0001h
ECCP1AS_PSS1AC1_LENGTH                   equ 0001h
ECCP1AS_PSS1AC1_MASK                     equ 0008h
ECCP1AS_ECCP1AS0_POSN                    equ 0004h
ECCP1AS_ECCP1AS0_POSITION                equ 0004h
ECCP1AS_ECCP1AS0_SIZE                    equ 0001h
ECCP1AS_ECCP1AS0_LENGTH                  equ 0001h
ECCP1AS_ECCP1AS0_MASK                    equ 0010h
ECCP1AS_ECCP1AS1_POSN                    equ 0005h
ECCP1AS_ECCP1AS1_POSITION                equ 0005h
ECCP1AS_ECCP1AS1_SIZE                    equ 0001h
ECCP1AS_ECCP1AS1_LENGTH                  equ 0001h
ECCP1AS_ECCP1AS1_MASK                    equ 0020h
ECCP1AS_ECCP1AS2_POSN                    equ 0006h
ECCP1AS_ECCP1AS2_POSITION                equ 0006h
ECCP1AS_ECCP1AS2_SIZE                    equ 0001h
ECCP1AS_ECCP1AS2_LENGTH                  equ 0001h
ECCP1AS_ECCP1AS2_MASK                    equ 0040h

// Register: CVRCONL
#define CVRCONL CVRCONL
CVRCONL                                  equ 0FBEh
// bitfield definitions
CVRCONL_CVRNSS_POSN                      equ 0000h
CVRCONL_CVRNSS_POSITION                  equ 0000h
CVRCONL_CVRNSS_SIZE                      equ 0001h
CVRCONL_CVRNSS_LENGTH                    equ 0001h
CVRCONL_CVRNSS_MASK                      equ 0001h
CVRCONL_CVRPSS_POSN                      equ 0004h
CVRCONL_CVRPSS_POSITION                  equ 0004h
CVRCONL_CVRPSS_SIZE                      equ 0002h
CVRCONL_CVRPSS_LENGTH                    equ 0002h
CVRCONL_CVRPSS_MASK                      equ 0030h
CVRCONL_CVROE_POSN                       equ 0006h
CVRCONL_CVROE_POSITION                   equ 0006h
CVRCONL_CVROE_SIZE                       equ 0001h
CVRCONL_CVROE_LENGTH                     equ 0001h
CVRCONL_CVROE_MASK                       equ 0040h
CVRCONL_CVREN_POSN                       equ 0007h
CVRCONL_CVREN_POSITION                   equ 0007h
CVRCONL_CVREN_SIZE                       equ 0001h
CVRCONL_CVREN_LENGTH                     equ 0001h
CVRCONL_CVREN_MASK                       equ 0080h
CVRCONL_CVRPSS0_POSN                     equ 0004h
CVRCONL_CVRPSS0_POSITION                 equ 0004h
CVRCONL_CVRPSS0_SIZE                     equ 0001h
CVRCONL_CVRPSS0_LENGTH                   equ 0001h
CVRCONL_CVRPSS0_MASK                     equ 0010h
CVRCONL_CVRPSS1_POSN                     equ 0005h
CVRCONL_CVRPSS1_POSITION                 equ 0005h
CVRCONL_CVRPSS1_SIZE                     equ 0001h
CVRCONL_CVRPSS1_LENGTH                   equ 0001h
CVRCONL_CVRPSS1_MASK                     equ 0020h

// Register: CVRCONH
#define CVRCONH CVRCONH
CVRCONH                                  equ 0FBFh
// bitfield definitions
CVRCONH_CVR_POSN                         equ 0000h
CVRCONH_CVR_POSITION                     equ 0000h
CVRCONH_CVR_SIZE                         equ 0005h
CVRCONH_CVR_LENGTH                       equ 0005h
CVRCONH_CVR_MASK                         equ 001Fh
CVRCONH_CVR0_POSN                        equ 0000h
CVRCONH_CVR0_POSITION                    equ 0000h
CVRCONH_CVR0_SIZE                        equ 0001h
CVRCONH_CVR0_LENGTH                      equ 0001h
CVRCONH_CVR0_MASK                        equ 0001h
CVRCONH_CVR1_POSN                        equ 0001h
CVRCONH_CVR1_POSITION                    equ 0001h
CVRCONH_CVR1_SIZE                        equ 0001h
CVRCONH_CVR1_LENGTH                      equ 0001h
CVRCONH_CVR1_MASK                        equ 0002h
CVRCONH_CVR2_POSN                        equ 0002h
CVRCONH_CVR2_POSITION                    equ 0002h
CVRCONH_CVR2_SIZE                        equ 0001h
CVRCONH_CVR2_LENGTH                      equ 0001h
CVRCONH_CVR2_MASK                        equ 0004h
CVRCONH_CVR3_POSN                        equ 0003h
CVRCONH_CVR3_POSITION                    equ 0003h
CVRCONH_CVR3_SIZE                        equ 0001h
CVRCONH_CVR3_LENGTH                      equ 0001h
CVRCONH_CVR3_MASK                        equ 0008h
CVRCONH_CVR4_POSN                        equ 0004h
CVRCONH_CVR4_POSITION                    equ 0004h
CVRCONH_CVR4_SIZE                        equ 0001h
CVRCONH_CVR4_LENGTH                      equ 0001h
CVRCONH_CVR4_MASK                        equ 0010h

