GopalSaraf/Practicals/PSDL/include/proc/pic18f87j94.inc
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, b
#define REFO1MD                          BANKMASK(PMD3), 1, b
#define REFO2MD                          BANKMASK(PMD3), 0, b
#define RELEASE                          BANKMASK(DSCONL), 0, b
#define REPU                             BANKMASK(PADCFG1), 6, b
#define RESUME                           BANKMASK(UCON), 2, a
#define RF2                              BANKMASK(PORTF), 2, a
#define RF3                              BANKMASK(PORTF), 3, a
#define RF4                              BANKMASK(PORTF), 4, a
#define RF5                              BANKMASK(PORTF), 5, a
#define RF6                              BANKMASK(PORTF), 6, a
#define RF7                              BANKMASK(PORTF), 7, a
#define RFPU                             BANKMASK(PADCFG1), 5, b
#define RG0                              BANKMASK(PORTG), 0, a
#define RG1                              BANKMASK(PORTG), 1, a
#define RG2                              BANKMASK(PORTG), 2, a
#define RG3                              BANKMASK(PORTG), 3, a
#define RG4                              BANKMASK(PORTG), 4, a
#define RGPU                             BANKMASK(PADCFG1), 4, b
#define RH0                              BANKMASK(PORTH), 0, a
#define RH1                              BANKMASK(PORTH), 1, a
#define RH2                              BANKMASK(PORTH), 2, a
#define RH3                              BANKMASK(PORTH), 3, a
#define RH4                              BANKMASK(PORTH), 4, a
#define RH5                              BANKMASK(PORTH), 5, a
#define RH6                              BANKMASK(PORTH), 6, a
#define RH7                              BANKMASK(PORTH), 7, a
#define RHPU                             BANKMASK(PADCFG1), 3, b
#define RI                               BANKMASK(RCON), 4, a
#define RJ0                              BANKMASK(PORTJ), 0, a
#define RJ1                              BANKMASK(PORTJ), 1, a
#define RJ2                              BANKMASK(PORTJ), 2, a
#define RJ3                              BANKMASK(PORTJ), 3, a
#define RJ4                              BANKMASK(PORTJ), 4, a
#define RJ5                              BANKMASK(PORTJ), 5, a
#define RJ6                              BANKMASK(PORTJ), 6, a
#define RJ7                              BANKMASK(PORTJ), 7, a
#define RKPU                             BANKMASK(PADCFG1), 1, b
#define RLPU                             BANKMASK(PADCFG1), 0, b
#define RPO0R0                           BANKMASK(RPOR0_1), 0, b
#define RPO0R1                           BANKMASK(RPOR0_1), 1, b
#define RPO0R2                           BANKMASK(RPOR0_1), 2, b
#define RPO0R3                           BANKMASK(RPOR0_1), 3, b
#define RPO10R0                          BANKMASK(RPOR10_11), 0, b
#define RPO10R1                          BANKMASK(RPOR10_11), 1, b
#define RPO10R2                          BANKMASK(RPOR10_11), 2, b
#define RPO10R3                          BANKMASK(RPOR10_11), 3, b
#define RPO11R0                          BANKMASK(RPOR10_11), 4, b
#define RPO11R1                          BANKMASK(RPOR10_11), 5, b
#define RPO11R2                          BANKMASK(RPOR10_11), 6, b
#define RPO11R3                          BANKMASK(RPOR10_11), 7, b
#define RPO12R0                          BANKMASK(RPOR12_13), 0, b
#define RPO12R1                          BANKMASK(RPOR12_13), 1, b
#define RPO12R2                          BANKMASK(RPOR12_13), 2, b
#define RPO12R3                          BANKMASK(RPOR12_13), 3, b
#define RPO13R0                          BANKMASK(RPOR12_13), 4, b
#define RPO13R1                          BANKMASK(RPOR12_13), 5, b
#define RPO13R2                          BANKMASK(RPOR12_13), 6, b
#define RPO13R3                          BANKMASK(RPOR12_13), 7, b
#define RPO14R0                          BANKMASK(RPOR14_15), 0, b
#define RPO14R1                          BANKMASK(RPOR14_15), 1, b
#define RPO14R2                          BANKMASK(RPOR14_15), 2, b
#define RPO14R3                          BANKMASK(RPOR14_15), 3, b
#define RPO15R0                          BANKMASK(RPOR14_15), 4, b
#define RPO15R1                          BANKMASK(RPOR14_15), 5, b
#define RPO15R2                          BANKMASK(RPOR14_15), 6, b
#define RPO15R3                          BANKMASK(RPOR14_15), 7, b
#define RPO16R0                          BANKMASK(RPOR16_17), 0, b
#define RPO16R1                          BANKMASK(RPOR16_17), 1, b
#define RPO16R2                          BANKMASK(RPOR16_17), 2, b
#define RPO16R3                          BANKMASK(RPOR16_17), 3, b
#define RPO17R0                          BANKMASK(RPOR16_17), 4, b
#define RPO17R1                          BANKMASK(RPOR16_17), 5, b
#define RPO17R2                          BANKMASK(RPOR16_17), 6, b
#define RPO17R3                          BANKMASK(RPOR16_17), 7, b
#define RPO18R0                          BANKMASK(RPOR18_19), 0, b
#define RPO18R1                          BANKMASK(RPOR18_19), 1, b
#define RPO18R2                          BANKMASK(RPOR18_19), 2, b
#define RPO18R3                          BANKMASK(RPOR18_19), 3, b
#define RPO19R0                          BANKMASK(RPOR18_19), 4, b
#define RPO19R1                          BANKMASK(RPOR18_19), 5, b
#define RPO19R2                          BANKMASK(RPOR18_19), 6, b
#define RPO19R3                          BANKMASK(RPOR18_19), 7, b
#define RPO1R0                           BANKMASK(RPOR0_1), 4, b
#define RPO1R1                           BANKMASK(RPOR0_1), 5, b
#define RPO1R2                           BANKMASK(RPOR0_1), 6, b
#define RPO1R3                           BANKMASK(RPOR0_1), 7, b
#define RPO20R0                          BANKMASK(RPOR20_21), 0, b
#define RPO20R1                          BANKMASK(RPOR20_21), 1, b
#define RPO20R2                          BANKMASK(RPOR20_21), 2, b
#define RPO20R3                          BANKMASK(RPOR20_21), 3, b
#define RPO21R0                          BANKMASK(RPOR20_21), 4, b
#define RPO21R1                          BANKMASK(RPOR20_21), 5, b
#define RPO21R2                          BANKMASK(RPOR20_21), 6, b
#define RPO21R3                          BANKMASK(RPOR20_21), 7, b
#define RPO22R0                          BANKMASK(RPOR22_23), 0, b
#define RPO22R1                          BANKMASK(RPOR22_23), 1, b
#define RPO22R2                          BANKMASK(RPOR22_23), 2, b
#define RPO22R3                          BANKMASK(RPOR22_23), 3, b
#define RPO23R0                          BANKMASK(RPOR22_23), 4, b
#define RPO23R1                          BANKMASK(RPOR22_23), 5, b
#define RPO23R2                          BANKMASK(RPOR22_23), 6, b
#define RPO23R3                          BANKMASK(RPOR22_23), 7, b
#define RPO24R0                          BANKMASK(RPOR24_25), 0, b
#define RPO24R1                          BANKMASK(RPOR24_25), 1, b
#define RPO24R2                          BANKMASK(RPOR24_25), 2, b
#define RPO24R3                          BANKMASK(RPOR24_25), 3, b
#define RPO25R0                          BANKMASK(RPOR24_25), 4, b
#define RPO25R1                          BANKMASK(RPOR24_25), 5, b
#define RPO25R2                          BANKMASK(RPOR24_25), 6, b
#define RPO25R3                          BANKMASK(RPOR24_25), 7, b
#define RPO26R0                          BANKMASK(RPOR26_27), 0, b
#define RPO26R1                          BANKMASK(RPOR26_27), 1, b
#define RPO26R2                          BANKMASK(RPOR26_27), 2, b
#define RPO26R3                          BANKMASK(RPOR26_27), 3, b
#define RPO27R0                          BANKMASK(RPOR26_27), 4, b
#define RPO27R1                          BANKMASK(RPOR26_27), 5, b
#define RPO27R2                          BANKMASK(RPOR26_27), 6, b
#define RPO27R3                          BANKMASK(RPOR26_27), 7, b
#define RPO28R0                          BANKMASK(RPOR28_29), 0, b
#define RPO28R1                          BANKMASK(RPOR28_29), 1, b
#define RPO28R2                          BANKMASK(RPOR28_29), 2, b
#define RPO28R3                          BANKMASK(RPOR28_29), 3, b
#define RPO29R0                          BANKMASK(RPOR28_29), 4, b
#define RPO29R1                          BANKMASK(RPOR28_29), 5, b
#define RPO29R2                          BANKMASK(RPOR28_29), 6, b
#define RPO29R3                          BANKMASK(RPOR28_29), 7, b
#define RPO2R0                           BANKMASK(RPOR2_3), 0, b
#define RPO2R1                           BANKMASK(RPOR2_3), 1, b
#define RPO2R2                           BANKMASK(RPOR2_3), 2, b
#define RPO2R3                           BANKMASK(RPOR2_3), 3, b
#define RPO30R0                          BANKMASK(RPOR30_31), 0, b
#define RPO30R1                          BANKMASK(RPOR30_31), 1, b
#define RPO30R2                          BANKMASK(RPOR30_31), 2, b
#define RPO30R3                          BANKMASK(RPOR30_31), 3, b
#define RPO31R0                          BANKMASK(RPOR30_31), 4, b
#define RPO31R1                          BANKMASK(RPOR30_31), 5, b
#define RPO31R2                          BANKMASK(RPOR30_31), 6, b
#define RPO31R3                          BANKMASK(RPOR30_31), 7, b
#define RPO32R0                          BANKMASK(RPOR32_33), 0, b
#define RPO32R1                          BANKMASK(RPOR32_33), 1, b
#define RPO32R2                          BANKMASK(RPOR32_33), 2, b
#define RPO32R3                          BANKMASK(RPOR32_33), 3, b
#define RPO33R0                          BANKMASK(RPOR32_33), 4, b
#define RPO33R1                          BANKMASK(RPOR32_33), 5, b
#define RPO33R2                          BANKMASK(RPOR32_33), 6, b
#define RPO33R3                          BANKMASK(RPOR32_33), 7, b
#define RPO34R0                          BANKMASK(RPOR34_35), 0, b
#define RPO34R1                          BANKMASK(RPOR34_35), 1, b
#define RPO34R2                          BANKMASK(RPOR34_35), 2, b
#define RPO34R3                          BANKMASK(RPOR34_35), 3, b
#define RPO35R0                          BANKMASK(RPOR34_35), 4, b
#define RPO35R1                          BANKMASK(RPOR34_35), 5, b
#define RPO35R2                          BANKMASK(RPOR34_35), 6, b
#define RPO35R3                          BANKMASK(RPOR34_35), 7, b
#define RPO36R0                          BANKMASK(RPOR36_37), 0, b
#define RPO36R1                          BANKMASK(RPOR36_37), 1, b
#define RPO36R2                          BANKMASK(RPOR36_37), 2, b
#define RPO36R3                          BANKMASK(RPOR36_37), 3, b
#define RPO37R0                          BANKMASK(RPOR36_37), 4, b
#define RPO37R1                          BANKMASK(RPOR36_37), 5, b
#define RPO37R2                          BANKMASK(RPOR36_37), 6, b
#define RPO37R3                          BANKMASK(RPOR36_37), 7, b
#define RPO38R0                          BANKMASK(RPOR38_39), 0, b
#define RPO38R1                          BANKMASK(RPOR38_39), 1, b
#define RPO38R2                          BANKMASK(RPOR38_39), 2, b
#define RPO38R3                          BANKMASK(RPOR38_39), 3, b
#define RPO39R0                          BANKMASK(RPOR38_39), 4, b
#define RPO39R1                          BANKMASK(RPOR38_39), 5, b
#define RPO39R2                          BANKMASK(RPOR38_39), 6, b
#define RPO39R3                          BANKMASK(RPOR38_39), 7, b
#define RPO3R0                           BANKMASK(RPOR2_3), 4, b
#define RPO3R1                           BANKMASK(RPOR2_3), 5, b
#define RPO3R2                           BANKMASK(RPOR2_3), 6, b
#define RPO3R3                           BANKMASK(RPOR2_3), 7, b
#define RPO40R0                          BANKMASK(RPOR40_41), 0, b
#define RPO40R1                          BANKMASK(RPOR40_41), 1, b
#define RPO40R2                          BANKMASK(RPOR40_41), 2, b
#define RPO40R3                          BANKMASK(RPOR40_41), 3, b
#define RPO41R0                          BANKMASK(RPOR40_41), 4, b
#define RPO41R1                          BANKMASK(RPOR40_41), 5, b
#define RPO41R2                          BANKMASK(RPOR40_41), 6, b
#define RPO41R3                          BANKMASK(RPOR40_41), 7, b
#define RPO42R0                          BANKMASK(RPOR42_43), 0, b
#define RPO42R1                          BANKMASK(RPOR42_43), 1, b
#define RPO42R2                          BANKMASK(RPOR42_43), 2, b
#define RPO42R3                          BANKMASK(RPOR42_43), 3, b
#define RPO43R0                          BANKMASK(RPOR42_43), 4, b
#define RPO43R1                          BANKMASK(RPOR42_43), 5, b
#define RPO43R2                          BANKMASK(RPOR42_43), 6, b
#define RPO43R3                          BANKMASK(RPOR42_43), 7, b
#define RPO44R0                          BANKMASK(RPOR44_45), 0, b
#define RPO44R1                          BANKMASK(RPOR44_45), 1, b
#define RPO44R2                          BANKMASK(RPOR44_45), 2, b
#define RPO44R3                          BANKMASK(RPOR44_45), 3, b
#define RPO45R0                          BANKMASK(RPOR44_45), 4, b
#define RPO45R1                          BANKMASK(RPOR44_45), 5, b
#define RPO45R2                          BANKMASK(RPOR44_45), 6, b
#define RPO45R3                          BANKMASK(RPOR44_45), 7, b
#define RPO46R0                          BANKMASK(RPOR46), 0, b
#define RPO46R1                          BANKMASK(RPOR46), 1, b
#define RPO46R2                          BANKMASK(RPOR46), 2, b
#define RPO46R3                          BANKMASK(RPOR46), 3, b
#define RPO4R0                           BANKMASK(RPOR4_5), 0, b
#define RPO4R1                           BANKMASK(RPOR4_5), 1, b
#define RPO4R2                           BANKMASK(RPOR4_5), 2, b
#define RPO4R3                           BANKMASK(RPOR4_5), 3, b
#define RPO5R0                           BANKMASK(RPOR4_5), 4, b
#define RPO5R1                           BANKMASK(RPOR4_5), 5, b
#define RPO5R2                           BANKMASK(RPOR4_5), 6, b
#define RPO5R3                           BANKMASK(RPOR4_5), 7, b
#define RPO6R0                           BANKMASK(RPOR6_7), 0, b
#define RPO6R1                           BANKMASK(RPOR6_7), 1, b
#define RPO6R2                           BANKMASK(RPOR6_7), 2, b
#define RPO6R3                           BANKMASK(RPOR6_7), 3, b
#define RPO7R0                           BANKMASK(RPOR6_7), 4, b
#define RPO7R1                           BANKMASK(RPOR6_7), 5, b
#define RPO7R2                           BANKMASK(RPOR6_7), 6, b
#define RPO7R3                           BANKMASK(RPOR6_7), 7, b
#define RPO8R0                           BANKMASK(RPOR8_9), 0, b
#define RPO8R1                           BANKMASK(RPOR8_9), 1, b
#define RPO8R2                           BANKMASK(RPOR8_9), 2, b
#define RPO8R3                           BANKMASK(RPOR8_9), 3, b
#define RPO9R0                           BANKMASK(RPOR8_9), 4, b
#define RPO9R1                           BANKMASK(RPOR8_9), 5, b
#define RPO9R2                           BANKMASK(RPOR8_9), 6, b
#define RPO9R3                           BANKMASK(RPOR8_9), 7, b
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, b
#define RTCCIE                           BANKMASK(PIE3), 0, a
#define RTCCIF                           BANKMASK(PIR3), 0, a
#define RTCCIP                           BANKMASK(IPR3), 0, a
#define RTCCLKSEL0                       BANKMASK(RTCCON2), 2, b
#define RTCCLKSEL1                       BANKMASK(RTCCON2), 3, b
#define RTCCMD                           BANKMASK(PMD3), 4, b
#define RTCEN                            BANKMASK(RTCCON1), 7, b
#define RTCOE                            BANKMASK(RTCCON1), 2, b
#define RTCPTR0                          BANKMASK(RTCCON1), 0, b
#define RTCPTR1                          BANKMASK(RTCCON1), 1, b
#define RTCSECSEL0                       BANKMASK(RTCCON2), 0, b
#define RTCSECSEL1                       BANKMASK(RTCCON2), 1, b
#define RTCSYNC                          BANKMASK(RTCCON1), 4, b
#define RTCWDIS                          BANKMASK(DSCONH), 0, b
#define RTCWREN                          BANKMASK(RTCCON1), 5, b
#define RVP0                             BANKMASK(PORTVP), 0, a
#define RVP1                             BANKMASK(PORTVP), 1, a
#define RVP2                             BANKMASK(PORTVP), 2, a
#define RVP3                             BANKMASK(PORTVP), 3, a
#define RVP4                             BANKMASK(PORTVP), 4, a
#define RVP5                             BANKMASK(PORTVP), 5, a
#define RVP6                             BANKMASK(PORTVP), 6, a
#define RVP7                             BANKMASK(PORTVP), 7, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, b
#define RXADDR0                          BANKMASK(RXADDRL), 0, a
#define RXADDR1                          BANKMASK(RXADDRL), 1, a
#define RXADDR10                         BANKMASK(RXADDRH), 2, a
#define RXADDR11                         BANKMASK(RXADDRH), 3, a
#define RXADDR2                          BANKMASK(RXADDRL), 2, a
#define RXADDR3                          BANKMASK(RXADDRL), 3, a
#define RXADDR4                          BANKMASK(RXADDRL), 4, a
#define RXADDR5                          BANKMASK(RXADDRL), 5, a
#define RXADDR6                          BANKMASK(RXADDRL), 6, a
#define RXADDR7                          BANKMASK(RXADDRL), 7, a
#define RXADDR8                          BANKMASK(RXADDRH), 0, a
#define RXADDR9                          BANKMASK(RXADDRH), 1, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, b
#define RXDTP3                           BANKMASK(BAUDCON3), 5, b
#define RXDTP4                           BANKMASK(BAUDCON4), 5, b
#define RXINC                            BANKMASK(DMACON1), 4, a
#define R_NOT_W1                         BANKMASK(SSP1STAT), 2, a
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, b
#define R_W1                             BANKMASK(SSP1STAT), 2, a
#define R_W2                             BANKMASK(SSP2STAT), 2, b
#define R_nW1                            BANKMASK(SSP1STAT), 2, a
#define R_nW2                            BANKMASK(SSP2STAT), 2, b
#define S00C0                            BANKMASK(LCDDATA0), 0, b
#define S00C1                            BANKMASK(LCDDATA8), 0, b
#define S00C2                            BANKMASK(LCDDATA16), 0, b
#define S00C3                            BANKMASK(LCDDATA24), 0, b
#define S00C4                            BANKMASK(LCDDATA32), 0, b
#define S00C5                            BANKMASK(LCDDATA40), 0, b
#define S00C6                            BANKMASK(LCDDATA48), 0, b
#define S00C7                            BANKMASK(LCDDATA56), 0, b
#define S01C0                            BANKMASK(LCDDATA0), 1, b
#define S01C1                            BANKMASK(LCDDATA8), 1, b
#define S01C2                            BANKMASK(LCDDATA16), 1, b
#define S01C3                            BANKMASK(LCDDATA24), 1, b
#define S01C4                            BANKMASK(LCDDATA32), 1, b
#define S01C5                            BANKMASK(LCDDATA40), 1, b
#define S01C6                            BANKMASK(LCDDATA48), 1, b
#define S01C7                            BANKMASK(LCDDATA56), 1, b
#define S02C0                            BANKMASK(LCDDATA0), 2, b
#define S02C1                            BANKMASK(LCDDATA8), 2, b
#define S02C2                            BANKMASK(LCDDATA16), 2, b
#define S02C3                            BANKMASK(LCDDATA24), 2, b
#define S02C4                            BANKMASK(LCDDATA32), 2, b
#define S02C5                            BANKMASK(LCDDATA40), 2, b
#define S02C6                            BANKMASK(LCDDATA48), 2, b
#define S02C7                            BANKMASK(LCDDATA56), 2, b
#define S03C0                            BANKMASK(LCDDATA0), 3, b
#define S03C1                            BANKMASK(LCDDATA8), 3, b
#define S03C2                            BANKMASK(LCDDATA16), 3, b
#define S03C3                            BANKMASK(LCDDATA24), 3, b
#define S03C4                            BANKMASK(LCDDATA32), 3, b
#define S03C5                            BANKMASK(LCDDATA40), 3, b
#define S03C6                            BANKMASK(LCDDATA48), 3, b
#define S03C7                            BANKMASK(LCDDATA56), 3, b
#define S04C0                            BANKMASK(LCDDATA0), 4, b
#define S04C1                            BANKMASK(LCDDATA8), 4, b
#define S04C2                            BANKMASK(LCDDATA16), 4, b
#define S04C3                            BANKMASK(LCDDATA24), 4, b
#define S04C4                            BANKMASK(LCDDATA32), 4, b
#define S04C5                            BANKMASK(LCDDATA40), 4, b
#define S04C6                            BANKMASK(LCDDATA48), 4, b
#define S04C7                            BANKMASK(LCDDATA56), 4, b
#define S05C0                            BANKMASK(LCDDATA0), 5, b
#define S05C1                            BANKMASK(LCDDATA8), 5, b
#define S05C2                            BANKMASK(LCDDATA16), 5, b
#define S05C3                            BANKMASK(LCDDATA24), 5, b
#define S05C4                            BANKMASK(LCDDATA32), 5, b
#define S05C5                            BANKMASK(LCDDATA40), 5, b
#define S05C6                            BANKMASK(LCDDATA48), 5, b
#define S05C7                            BANKMASK(LCDDATA56), 5, b
#define S06C0                            BANKMASK(LCDDATA0), 6, b
#define S06C1                            BANKMASK(LCDDATA8), 6, b
#define S06C2                            BANKMASK(LCDDATA16), 6, b
#define S06C3                            BANKMASK(LCDDATA24), 6, b
#define S06C4                            BANKMASK(LCDDATA32), 6, b
#define S06C5                            BANKMASK(LCDDATA40), 6, b
#define S06C6                            BANKMASK(LCDDATA48), 6, b
#define S06C7                            BANKMASK(LCDDATA56), 6, b
#define S07C0                            BANKMASK(LCDDATA0), 7, b
#define S07C1                            BANKMASK(LCDDATA8), 7, b
#define S07C2                            BANKMASK(LCDDATA16), 7, b
#define S07C3                            BANKMASK(LCDDATA24), 7, b
#define S07C4                            BANKMASK(LCDDATA32), 7, b
#define S07C5                            BANKMASK(LCDDATA40), 7, b
#define S07C6                            BANKMASK(LCDDATA48), 7, b
#define S07C7                            BANKMASK(LCDDATA56), 7, b
#define S08C0                            BANKMASK(LCDDATA1), 0, b
#define S08C1                            BANKMASK(LCDDATA9), 0, b
#define S08C2                            BANKMASK(LCDDATA17), 0, b
#define S08C3                            BANKMASK(LCDDATA25), 0, b
#define S08C4                            BANKMASK(LCDDATA33), 0, b
#define S08C5                            BANKMASK(LCDDATA41), 0, b
#define S08C6                            BANKMASK(LCDDATA49), 0, b
#define S08C7                            BANKMASK(LCDDATA57), 0, b
#define S09C0                            BANKMASK(LCDDATA1), 1, b
#define S09C1                            BANKMASK(LCDDATA9), 1, b
#define S09C2                            BANKMASK(LCDDATA17), 1, b
#define S09C3                            BANKMASK(LCDDATA25), 1, b
#define S09C4                            BANKMASK(LCDDATA33), 1, b
#define S09C5                            BANKMASK(LCDDATA41), 1, b
#define S09C6                            BANKMASK(LCDDATA49), 1, b
#define S09C7                            BANKMASK(LCDDATA57), 1, b
